/* --------------------- */
/* Type Conversion       */
/* --------------------- */

/* 데이터 → 문자 ----------------------------------------------------------- */

// number
const YEAR = 2025;

console.log(String(YEAR));


// undefined, null

// boolean

/* 데이터 → 숫자 ----------------------------------------------------------- */

// undefined

// null

// boolean

// string

// numeric string

/* 데이터 → 불리언 ---------------------------------------------------------- */

// null, undefined, 0, NaN, ''
// 위에 나열한 것 이외의 것들
